# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library.

In [2]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [40]:
# your code here
df = pd.read_json(r'.\data\nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [41]:
# your code here
df.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### La fonction `value_counts()` est couramment utilisée dans pandas pour trouver la fréquence de chaque valeur dans une colonne.

Dans la cellule ci-dessous, utilisez la fonction `value_counts()` pour déterminer la fréquence de tous les types de chutes de météorites en appliquant la fonction sur la colonne `fall`.

In [44]:
# your code here
#df['fall'].value_counts()
df.value_counts('fall')

fall
Fell     996
Found      4
Name: count, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [45]:
# your code here
df.to_json('./data/nasa-output.json', orient='records')

# Défi 2 - Travailler avec des fichiers CSV et autres fichiers délimités

Les fichiers CSV sont couramment utilisés comme dataframes. Dans la cellule ci-dessous, chargez le fichier à partir de l’URL fournie en utilisant la fonction `read_csv()` de pandas. Depuis la version 0.19 de pandas, vous pouvez charger un fichier CSV directement depuis une URL dans un dataframe, sans avoir à télécharger le fichier au préalable puis le transformer. Le jeu de données que nous allons utiliser contient des informations sur les navettes spatiales de la NASA.

Dans la cellule ci-dessous, nous définissons les noms des colonnes et l’URL des données. Après cette cellule, lisez le fichier `tst` dans une variable appelée `shuttle`. Comme le fichier ne contient pas les noms de colonnes, vous devez les ajouter vous-même en utilisant les noms de colonnes déclarés dans `cols` grâce à l’argument `names`. De plus, comme un fichier `tst` est séparé par des espaces, veillez à indiquer `sep=' '` à la fonction.

In [13]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [46]:
# your code here

shuttle = pd.read_csv(tst_url, sep=' ', names=cols)

Let's verify that this worked by looking at the `head()` function.

In [48]:
# your code here
shuttle.head(10)

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1
41,0,84,3,38,-4,43,45,2,1
37,0,100,0,36,-8,63,64,2,1
46,0,83,0,46,0,37,36,0,1
44,0,79,0,42,-17,35,37,2,1
44,-1,78,0,44,0,34,34,0,1

Pour nous simplifier la vie, transformons ce dataframe en un fichier séparé par des virgules en le sauvegardant avec la fonction `to_csv()`.  
Sauvegardez `shuttle` dans un fichier `shuttle.csv` et assurez-vous que le fichier est bien séparé par des virgules, que la colonne d’index **n’est pas sauvegardée**, et que le fichier est enregistré dans le dossier `data`.

In [17]:
# your code here
shuttle.to_csv('./data/shuttle.csv', sep=',', index=False)

# Défi 3 - Travailler avec des fichiers Excel

Nous pouvons également utiliser pandas pour convertir des feuilles de calcul Excel en dataframes. Utilisons la fonction `read_excel()`.  
Dans ce cas, le fichier `astronauts.xls` se trouve dans le dossier `data`. Lisez ce fichier et assignez-le à une variable appelée `astronaut`.

**Remarque :** Assurez-vous d’installer la bibliothèque `xlrd` si elle n’est pas encore installée.

In [1]:
! pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.2-py2.py3-none-any.whl.metadata (3.5 kB)
Downloading xlrd-2.0.2-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.2

Use the `head()` function to inspect the dataframe.

In [49]:
# your code here
astronaut = pd.read_excel(r'.\data\astronauts.xls')
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [24]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Undergraduate Major
Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Astronomy                                 1
Marine Engineering & Nautical Science     1
Philosophy                                1
Bioscience                                1
Military Science                          1
Name: count, Length: 83, dtype: int64

En raison de toutes les virgules présentes dans les cellules de ce fichier, sauvegardons-le sous forme de fichier CSV séparé par des tabulations.  
Dans la cellule ci-dessous, sauvegardez `astronaut` en fichier **séparé par des tabulations** en utilisant la fonction `to_csv`.  
Nommez le fichier `astronaut.csv`. N’oubliez pas de retirer la colonne d’index et d’enregistrer le fichier dans le dossier `data`.

In [27]:
# your code here
astronaut.to_csv('./data/astronaut.csv', sep='\t', index=False)

# Défi Bonus - Jeu de Données Fertility

Visitez l’URL suivante : [Fertility Dataset - UCI](https://archive.ics.uci.edu/ml/datasets/Fertility) et récupérez le jeu de données ainsi que les noms des colonnes. Déterminez le séparateur correct et lisez le fichier dans une variable appelée `fertility`. Examinez le dataframe en utilisant la fonction `head()`.

**Indice :** Cherchez sur Google comment récupérer ces données !

In [35]:

# your code here
col =['Variable_Name','Role','Type','Demographic',	'Description',	'Units',	'Missing_Values']
fertility = pd.read_csv('./data/fertility_Diagnosis.txt', sep = ",", names = col)
fertility.head()

              Variable_Name  Role  Type  Demographic  Description  Units  \
-0.33 0.69 0              1     1     0          0.8            0   0.88
      0.94 1              0     1     0          0.8            1   0.31
      0.50 1              0     0     0          1.0           -1   0.50
      0.75 0              1     1     0          1.0           -1   0.38
      0.67 1              1     0     0          0.8           -1   0.50

             Missing_Values
-0.33 0.69 0              N
      0.94 1              O
      0.50 1              N
      0.75 0              N
      0.67 1              O